# Pandas Week 5

# 17. Resampling pada  time series data

In [1]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

In [2]:
#Data Frame Prep
n_rows=365 *24
n_cols=2
cols=['col1','col2']

df=pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)),
               columns=cols)

df.index=pd.util.testing.makeDateIndex(n_rows, freq='H')
df

C:\Users\Markvinson\anaconda3\lib\site-packages\pandas\util\__init__.py:12: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                     col1  col2
2000-01-01 00:00:00     4    16
2000-01-01 01:00:00     5     6
2000-01-01 02:00:00     4     5
2000-01-01 03:00:00     1     4
2000-01-01 04:00:00    18    19
...                   ...   ...
2000-12-30 19:00:00     9    11
2000-12-30 20:00:00    15     7
2000-12-30 21:00:00    16    10
2000-12-30 22:00:00    16    18
2000-12-30 23:00:00     2    19

[8760 rows x 2 columns]

# Resampling data dengan interval monthly atau Bulan

In [3]:
df.resample('M')['col1'].sum().to_frame()
#data yang kita akses sudah tidak bisa per individual data tetapi yang bisa kita akses adalah data agregasi

            col1
2000-01-31  7298
2000-02-29  6734
2000-03-31  7243
2000-04-30  7416
2000-05-31  7458
2000-06-30  7250
2000-07-31  7240
2000-08-31  7646
2000-09-30  7244
2000-10-31  7495
2000-11-30  7221
2000-12-31  7101

# Resampling data dengan interval Daily atau hari

In [4]:
df.resample('D')['col1'].sum().to_frame()

            col1
2000-01-01   221
2000-01-02   236
2000-01-03   195
2000-01-04   265
2000-01-05   239
...          ...
2000-12-26   219
2000-12-27   205
2000-12-28   299
2000-12-29   205
2000-12-30   212

[365 rows x 1 columns]

# 18. Membentuk dummy Data Frame

In [5]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

# Membentuk Data Frame dari Dictionary

In [6]:
pd.DataFrame({'col1':[1,2,3],
             'col2':[5,6,7]})

   col1  col2
0     1     5
1     2     6
2     3     7

# Membentuk Data Frame dari Numpy Array

In [7]:
n_rows=5
n_cols=3

arr=np.random.randint(1,20,size=(n_rows, n_cols))
arr

array([[ 9,  3, 12],
       [13, 16,  7],
       [ 8, 14,  3],
       [15, 13,  1],
       [ 1,  7, 12]])

In [8]:
pd.DataFrame(arr,columns=tuple('ABC'))

    A   B   C
0   9   3  12
1  13  16   7
2   8  14   3
3  15  13   1
4   1   7  12

# Membentuk Data Frame dengan memanfaatkan pandas.util.testing

In [9]:
pd.util.testing.makeDataFrame().head()
#Membuat sebuah Dummy Data Frame sederhana

                   A         B         C         D
D5v0LPPEPy  0.379429  1.764169  0.471369 -0.402845
pPYQ4TLsBC  0.387352 -1.892210 -0.629272  0.055942
WFURxn8sWI  0.593588  1.395006  2.353247 -0.876895
5Eq6EOk2KE  0.893267 -1.591429 -0.024658 -1.626824
Yabzi0K9De  0.111196 -0.696500 -1.970783 -1.013995

In [10]:
pd.util.testing.makeMixedDataFrame().head()
#Membuat sebuah Dummy Data Frame dengan tipe data campuran

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

In [11]:
pd.util.testing.makeTimeDataFrame().head()
#Membentuk DataFrame yang berisi tipe data waktu

                   A         B         C         D
2000-01-03 -1.445923  0.013082 -1.073798 -1.236008
2000-01-04 -0.703756  2.031643  0.593736  1.148883
2000-01-05 -0.190801 -0.595305  0.274482  1.175906
2000-01-06  0.405003  1.021338 -0.305311 -0.662997
2000-01-07  0.311412 -0.017309  1.012671  1.223113

In [12]:
pd.util.testing.makeMissingDataframe().head()
#Membentuk DataFrame dummy yang memiliki beberapa missing value atu NaN yang ditempatkan secara acak

                   A         B         C         D
JM70g878Pu -0.714162 -0.486863 -0.057366  0.595785
iKKtzmu9Lk -0.257414 -1.092126  1.349956 -1.027717
8LXil51KSu  1.378600 -0.969982       NaN       NaN
AiOnJQHjQM  0.684133 -0.220585 -0.152761  1.716181
BI14Wz6ZhV -0.753927  1.426161  0.971431  1.426419

# 19. Formatting tampilan Data Frame

In [13]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

Data Frame Prep

In [39]:
n_rows=5
n_cols=2
cols=['Omset','Operasional']

df=pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)),
               columns=cols)


df

   Omset  Operasional
0     15           16
1     16           18
2      9           16
3      4           18
4      4            3

In [40]:
df['Omset']=df['Operasional']*100_000
df['Omset']=df['Operasional']*10_000
df

    Omset  Operasional
0  160000           16
1  180000           18
2  160000           16
3  180000           18
4   30000            3

In [41]:
df.index = pd.util.testing.makeDateIndex(n_rows,freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

     tanggal   Omset  Operasional
0 2000-01-01  160000           16
1 2000-01-02  180000           18
2 2000-01-03  160000           16
3 2000-01-04  180000           18
4 2000-01-05   30000            3

# Melakukan Formatting Tampilan Data Frame

In [42]:
formatku = {'tanggal':'{:%d/%m/%y}', # untuk membentuk format tanggal
           'Omset': 'Rp {:.2f}',
            'Operasional': 'Rp{:.2f}'}
laporan = df.style.format(formatku)
laporan
#2f berarti menampilkan nilai dengan 2 angka dibelakang koma

In [43]:
type(laporan)

pandas.io.formats.style.Styler

In [44]:
laporan.hide_index()

In [45]:
laporan.set_caption('Data Omset dan Operasional')

In [47]:
laporan.highlight_min('Omset',color='magenta')
laporan.highlight_max('Omset',color='lightgreen')

laporan.highlight_min('Operasional',color='lightblue')
laporan.highlight_max('Operasional',color='grey')
#highlight_max digunakan untuk menandai nilai maximum
#highlight_min digunakan untuk menandai nilai minimum

# 20. Menggabungkan dua Data Frame secara berdampingan

In [49]:
#import modules
import pandas as pd
import numpy as np 

#check Version
print(pd.__version__)
print(pd.__version__)

1.1.3
1.1.3

Data Frame Prep

In [48]:
d1={'col1':[1,2,3],
   'col2':[10,20,30]}
df1=pd.DataFrame(d1)
df1

   col1  col2
0     1    10
1     2    20
2     3    30

In [12]:
d2={'col3':[15,25,35],
   'col4':[40,45,60]}
df2=pd.DataFrame(d2)
df2

   col3  col4
0    15    40
1    25    45
2    35    60

# Menggabungkan (merge) dua Data Frame secara berdampingan

In [23]:
df=pd.merge(df1,df2,left_index=True, right_index=True)
df

   col1  col2  col3  col4
0     1    10    15    40
1     2    20    25    45
2     3    30    35    60

source: https://www.youtube.com/playlist?list=PL2O3HdJI4voGdD_9xhVCTBoDTDNHpajm5